app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
---
  <div class='comment'>
    <% post.most_recent_comments.each do |comment| %>