app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 4], ["id", 5]]
---
  <div class="comment">
    <% @post.comments.includes([:user]).each do |comment| %>