app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-10-27 18:46:22.941531"], ["updated_at", "2022-10-27 18:46:22.941531"], ["user_id", 7], ["post_id", 8]]
---
  def create
    post = Post.find(params[:post_id])
    like = Like.new
    like.user = current_user
    like.post = post
    if like.save