app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def display
        @posts = Post.find(params[:id])