app/controllers/users_controller.rb

    def display
        @user = User.find(param[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]