app/models/post.rb

UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) + $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 7]]
---
  def update_posts_counter
    user.increment!(:posts_counter)